In [2]:
from pandas import DataFrame,Series
import pandas as pd

### Series
类似一维数组，由数据和索引组成，索引可省略

In [3]:
# 省略索引，自动生成
obj = Series(['Allen','Bill','Didi','Cash'])
obj

0    Allen
1     Bill
2     Didi
3     Cash
dtype: object

In [4]:
obj2 = Series(['Allen','Bill','Didi','Cash'],index=['A','B','D','C'])
obj2

A    Allen
B     Bill
D     Didi
C     Cash
dtype: object

In [5]:
obj2['A']

'Allen'

In [6]:
# 索引可以是一个值对象，也可以是一个列表对象，反正只能是一个对象
obj2[['A','B']]

A    Allen
B     Bill
dtype: object

In [7]:
# 可以视为一个字典——索引到数据的映射
'A' in obj2

True

In [8]:
# 因此可以通过一个字典创建一个Series对象
# 索引是乱序的
data={'id':'yikayiyo','sex':'♂','age':'Ha?'}
obj3 = Series(data)
obj3

age         Ha?
id     yikayiyo
sex           ♂
dtype: object

In [9]:
# 指定索引，找不对应数据的NaN填充
data={'id':'yikayiyo','sex':'♂','age':'Ha?'}
obj4 = Series(data,index=['id','age','sex','tel'])
obj4

id     yikayiyo
age         Ha?
sex           ♂
tel         NaN
dtype: object

In [10]:
# 作用相反的两个函数
# obj4.notnull()
obj4.isnull()

id     False
age    False
sex    False
tel     True
dtype: bool

In [11]:
obj3+obj4

age              Ha?Ha?
id     yikayiyoyikayiyo
sex                  ♂♂
tel                 NaN
dtype: object

In [12]:
obj4.name = 'infos'
obj4.index.name='info'
obj4

info
id     yikayiyo
age         Ha?
sex           ♂
tel         NaN
Name: infos, dtype: object

In [13]:
#索引可以赋值修改
obj.index=['AA','BB','DD','CC']
obj

AA    Allen
BB     Bill
DD     Didi
CC     Cash
dtype: object

### DataFrame 
表格型的数据结构
可以传入等长列表或Numpy数组组成的字典

In [14]:
data={'name':['A','B','C'],'age':[29,27,18],'sex':['male','female','male']}
frame=DataFrame(data)
frame

   age name     sex
0   29    A    male
1   27    B  female
2   18    C    male

In [15]:
# columns 指定列顺序
frame = DataFrame(data,columns=['name','age','sex'])
frame

  name  age     sex
0    A   29    male
1    B   27  female
2    C   18    male

In [16]:
# 多出的columns 会补NaN ，index多出或者不够都会报错
frame2 = DataFrame(data,columns=['name','age','sex','tel'],index=['one','two','three'])
frame2

      name  age     sex  tel
one      A   29    male  NaN
two      B   27  female  NaN
three    C   18    male  NaN

In [17]:
frame2.sex

one        male
two      female
three      male
Name: sex, dtype: object

In [18]:
# 另一种写法
frame2['sex']

one        male
two      female
three      male
Name: sex, dtype: object

In [19]:
# 根据索引返回某行
# ix 不推荐使用了
frame2.loc['one']

name       A
age       29
sex     male
tel      NaN
Name: one, dtype: object

In [20]:
# 为某列NaN赋值
val=Series({'one':'0001','two':'0002','three':'0003'})
# 别的写法
# val=Series(data=['001','002','003'],index=['one','two','three'])
frame2.tel = val
frame2

      name  age     sex   tel
one      A   29    male  0001
two      B   27  female  0002
three    C   18    male  0003

In [21]:
frame2['address']=frame2.sex=='male'
#无效的写法frame2.address=Series(data=['ss','s','sss'],index=['one','two','three'])
frame2

      name  age     sex   tel  address
one      A   29    male  0001     True
two      B   27  female  0002    False
three    C   18    male  0003     True

In [22]:
# 无效
del frame2.address

AttributeError: address

In [23]:
frame2

      name  age     sex   tel  address
one      A   29    male  0001     True
two      B   27  female  0002    False
three    C   18    male  0003     True

In [24]:
del frame2['address']

In [25]:
frame2

      name  age     sex   tel
one      A   29    male  0001
two      B   27  female  0002
three    C   18    male  0003

-----------------------------------------------
传入嵌套字典
外层字典的键作为列，内层字典的键作为行索引

In [27]:
pop={'name':{'one':'A','two':'B'},
    'age':{'one':'22','two':'33'},
     'sex':{'one':'male','two':'female'},
     'tel':{'one':'0001','two':'0002'},
    }
frame3 = DataFrame(pop)
frame3

    age name     sex   tel
one  22    A    male  0001
two  33    B  female  0002

In [30]:
#显示指定index
frame4 = DataFrame(pop,index=['one','three','two'])
frame4

       age name     sex   tel
one     22    A    male  0001
three  NaN  NaN     NaN   NaN
two     33    B  female  0002

In [35]:
# frame4.index.name=''
frame4.columns.name=''
frame4

       age name     sex   tel

one     22    A    male  0001
three  NaN  NaN     NaN   NaN
two     33    B  female  0002

### 索引对象

In [42]:
obj_index = Series(range(3),index=['a','b','c'])
index = obj_index.index
index

Index(['a', 'b', 'c'], dtype='object')

In [43]:
index[1]

'b'

In [44]:
# index 不可修改
index[1]='change'

TypeError: Index does not support mutable operations

In [47]:
import numpy as np
newindex = pd.Index(np.arange(3))
newindex

Int64Index([0, 1, 2], dtype='int64')

In [48]:
obj_index_2 = Series([1.5,2.5,0],index=newindex)
obj_index_2

0    1.5
1    2.5
2    0.0
dtype: float64

### 缺失数据处理

In [66]:
string_data = Series([None,'bbbbb',np.nan,'ddddd'])
string_data

0     None
1    bbbbb
2      NaN
3    ddddd
dtype: object

In [67]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool